충돌문제 로컬에서 처리
